#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # juju_application.hydra will be created
  + resource "juju_application" "hydra" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "hydra"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "hydra"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.kratos will be created
  + resource "juju_application" "kratos" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.login_ui will be created
  + resource "juju_application" "login_ui" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "login-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_offer.kratos_info_offer will be created
  + resource "juju_offer" "kratos_info_offer" {
      + application_name = "kratos"
      + endpoint         = "kratos-info"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "kratos-info-offer"
      + url              = (known after apply)
    }

  # juju_offer.oauth_offer will be created
  + resource "juju_offer" "oauth_offer" {
      + application_name = "hydra"
      + endpoint         = "oauth"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "oauth-offer"
      + url              = (known after apply)
    }

  # module.kratos_external_idp_integrator.juju_application.external_idp_integrator will be created
  + resource "juju_application" "external_idp_integrator" {
      + config      = (sensitive value)
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos-external-idp-integrator"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos-external-idp-integrator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # module.postgresql.juju_application.postgresql will be created
  + resource "juju_application" "postgresql" {
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "postgresql"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "14/stable"
          + name     = "postgresql-k8s"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*